In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('Bengaluru_House_Data.csv')

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
df.drop(columns=['area_type','availability','society','balcony'], inplace=True)

In [8]:
df.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [9]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [10]:
df['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [11]:
df['location']=df['location'].fillna('Sarjapur Road')

In [12]:
df['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [13]:
df['size']=df['size'].fillna('2 BHK')

In [14]:
df['bath']=df['bath'].fillna(df['bath'].median)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  object
 4   price       13320 non-null  float64
dtypes: float64(1), object(4)
memory usage: 520.4+ KB

In [16]:
df['bhk']=df['size'].apply(lambda x: int(x.split(' ')[0]))

In [17]:
df

                       location       size total_sqft bath   price  bhk
0      Electronic City Phase II      2 BHK       1056  2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom       2600  5.0  120.00    4
2                   Uttarahalli      3 BHK       1440  2.0   62.00    3
3            Lingadheeranahalli      3 BHK       1521  3.0   95.00    3
4                      Kothanur      2 BHK       1200  2.0   51.00    2
...                         ...        ...        ...  ...     ...  ...
13315                Whitefield  5 Bedroom       3453  4.0  231.00    5
13316             Richards Town      4 BHK       3600  5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK       1141  2.0   60.00    2
13318           Padmanabhanagar      4 BHK       4689  4.0  488.00    4
13319              Doddathoguru      1 BHK        550  1.0   17.00    1

[13320 rows x 6 columns]

In [18]:
df[df.bhk > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [19]:
df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [20]:
def convertRange(x):
    temp = x.split('-')
    if len(temp)==2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [21]:
df['total_sqft']=df['total_sqft'].apply(convertRange)

In [22]:
df.head()

                   location       size  total_sqft bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0  2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0  5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0  2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0  3.0   95.00    3
4                  Kothanur      2 BHK      1200.0  2.0   51.00    2

### Price per square feet

In [23]:
df['price_per_sqft']=df['price']*100000 / df['total_sqft']

In [24]:
df['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [25]:
df.describe()

         total_sqft         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694    112.565627      2.802778    7.907501e+03
std     1238.405258    148.971674      1.294496    1.064296e+05
min        1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000    120.000000      3.000000    7.311746e+03
max    52272.000000   3600.000000     43.000000    1.200000e+07

In [26]:
df.dtypes

location           object
size               object
total_sqft        float64
bath               object
price             float64
bhk                 int64
price_per_sqft    float64
dtype: object

In [27]:
df.isnull().sum()

location           0
size               0
total_sqft        46
bath               0
price              0
bhk                0
price_per_sqft    46
dtype: int64

In [28]:
df["bath"] = pd.to_numeric(df["bath"], errors='coerce')

In [29]:
df.isnull().sum()

location           0
size               0
total_sqft        46
bath              73
price              0
bhk                0
price_per_sqft    46
dtype: int64

In [30]:
df.dropna(axis=0, inplace=True)

In [31]:
df.isnull().sum()

location          0
size              0
total_sqft        0
bath              0
price             0
bhk               0
price_per_sqft    0
dtype: int64

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13201 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        13201 non-null  object
 1   size            13201 non-null  object
 2   total_sqft      13201 non-null  float64
 3   bath            13201 non-null  float64
 4   price           13201 non-null  float64
 5   bhk             13201 non-null  int64
 6   price_per_sqft  13201 non-null  float64
dtypes: float64(4), int64(1), object(2)
memory usage: 825.1+ KB

In [33]:
df.shape

(13201, 7)

In [34]:
df['location'].value_counts()

Whitefield                        532
Sarjapur  Road                    392
Electronic City                   302
Kanakpura Road                    264
Thanisandra                       232
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
Kannur                              1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1299, dtype: int64

In [35]:
df['location']=df['location'].apply(lambda x: x.strip())
location_count=df['location'].value_counts()

In [36]:
location_count

Whitefield                        533
Sarjapur  Road                    392
Electronic City                   304
Kanakpura Road                    264
Thanisandra                       235
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
Kannur                              1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1288, dtype: int64

In [37]:
location_count_less_10=location_count[location_count<=10]
location_count_less_10

BTM 1st Stage                     10
Nagappa Reddy Layout              10
Sector 1 HSR Layout               10
Basapura                          10
Naganathapura                     10
                                  ..
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
Kannur                             1
singapura paradise                 1
Abshot Layout                      1
Name: location, Length: 1048, dtype: int64

In [38]:
df['location']=df['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [39]:
df['location'].value_counts()

other              2873
Whitefield          533
Sarjapur  Road      392
Electronic City     304
Kanakpura Road      264
                   ...
Doddaballapur        11
Tindlu               11
Marsur               11
HAL 2nd Stage        11
Kodigehalli          11
Name: location, Length: 241, dtype: int64

### outliers detection and removal

In [40]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13201.000000  13201.000000  13201.000000  13201.000000    1.320100e+04
mean    1555.306169      2.691160    112.274187      2.800848    7.920566e+03
std     1237.276637      1.338867    149.170520      1.292796    1.067231e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267782e+03
50%     1275.000000      2.000000     71.890000      3.000000    5.438066e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317073e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [41]:
(df['total_sqft']/df['bhk']).describe()

count    13201.000000
mean       573.844193
std        388.065440
min          0.250000
25%        473.000000
50%        552.000000
75%        625.000000
max      26136.000000
dtype: float64

In [42]:
df=df[((df['total_sqft']/df['bhk']) >= 300)]

In [43]:
df.shape

(12457, 7)

In [44]:
df.price_per_sqft.describe()

count     12457.000000
mean       6308.427888
std        4167.968413
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [45]:
def remove_outliers_sqft(df2):
    df_output = pd.DataFrame()
    for key,subdf in df2.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        gen_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index=True)
    return df_output
df = remove_outliers_sqft(df)
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10243.000000  10243.000000  10243.000000  10243.000000    10243.000000
mean    1504.032481      2.474470     90.990934      2.572684     5657.708390
std      876.755773      0.981874     86.143641      0.897209     2266.259922
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1108.000000      2.000000     49.000000      2.000000     4244.830457
50%     1282.000000      2.000000     67.000000      2.000000     5173.279759
75%     1650.000000      3.000000    100.000000      3.000000     6425.901331
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [46]:
import numpy as np

def bhk_outlier_remover(df2):
    exclude_indices = []  # Use a list for better performance
    
    for location, location_df in df2.groupby('location'):
        bhk_stats = {}
        
        # Group by 'bhk' within each location
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        
        # Iterate over 'bhk' again to find outliers
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk - 1)
            
            # Exclude outliers if there's a previous BHK and enough data
            if stats and stats['count'] > 5:
                exclude_indices.extend(bhk_df[bhk_df.price_per_sqft < stats['mean']].index.values)
    
    # Return the dataframe excluding the identified outliers
    return df2.drop(exclude_indices, axis='index')

# Apply the function to your DataFrame df
df = bhk_outlier_remover(df)

In [47]:
df=bhk_outlier_remover(df)

In [48]:
df.shape

(6751, 7)

In [49]:
df.drop(columns=['size','price_per_sqft'], inplace=True)

### cleaned data

In [50]:
df.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [51]:
df.to_csv('Cleaned_Bengaluru_Data.csv')

### Applying Linear Regression

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6751 entries, 0 to 10242
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    6751 non-null   object
 1   total_sqft  6751 non-null   float64
 2   bath        6751 non-null   float64
 3   price       6751 non-null   float64
 4   bhk         6751 non-null   int64
dtypes: float64(3), int64(1), object(1)
memory usage: 316.5+ KB

In [53]:
x=df.drop(columns=['price'])
y=df['price']

In [54]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [55]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.3, random_state=0)

In [56]:
print(x_train.shape)
print(x_test.shape)

(4725, 4)
(2026, 4)

In [57]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']), remainder='passthrough')

In [58]:
scaler = StandardScaler()

In [59]:
lr = LinearRegression()

In [60]:
pipe = make_pipeline(column_trans, scaler, lr)

In [61]:
pipe.fit(x_train, y_train)

C:\Users\aryan\anaconda3\Lib\site-packages\sklearn\preprocessing\_encoders.py:868: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression())])

In [62]:
y_pred_lr = pipe.predict(x_test)

In [63]:
r2_score(y_test, y_pred_lr)

0.7532071651026542

In [64]:
import pickle

In [66]:
pickle.dump(pipe,open('RidgeModel.pkl','wb'))